# ContFootingCannotJoin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..ContFootingCannotJoin Property
BuiltInFailures..::..WallFailures Class See Also
---
Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContFootingCannotJoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContFootingCannotJoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContFootingCannotJoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace